Repository: mishin/perldoc-ru
Catalog: pod2-ru/tm/The Grails Framework 2.0.0 - Reference Documentation-level2.tmx
Source language: en_us
Languages: ru_ru

source: So you can pass the --non-interactive switch to the script command to tell Grails to accept the default answer for any questions, for example whether to install a missing plugin.
ru_ru: вы можете передать команде ключ --non-interactive чтобы сказать Grails применять умолчательные ответы на вопросы, например устанавливать ли отсутствующие плагины.

source: Sponsored by SpringSource
ru_ru: Спонсор SpringSource

source: Spring 3.1 Profile Support
ru_ru: Поддержка профиля Spring 3.1

source: SpringSource - Weapons for the War on Java Complexity
ru_ru: SpringSource - оружие для войны со сложностью Java

source: Static Resource Abstraction
ru_ru: Абстракция статических ресурсов

source: Support for internationalization (i18n) built on Spring's core MessageSource concept
ru_ru: Поддержка интернационализации (i18n), построенной на концепции MessageSource ядра Spring.

source: TAB completion also works for class names after the create-* commands:
ru_ru: Автозавершение по TAB также работает для имен классов после команды create-*:

source: Table of Contents
ru_ru: Оглавление

source: Table of contents
ru_ru: Оглавление

source: Table-per-hierarchy mapping has a down side in that you cannot have non-nullable properties with inheritance mapping.
ru_ru: У отображения таблица-на-иерархию есть обратная сторона в том, что вы не можете иметь не нулевые свойства в наследованном отображении.

source: Tag Libraries
ru_ru: Библиотеки тегов

source: Tags
ru_ru: Теги

source: Test output from the test-app command has been improved:
ru_ru: Был улучшен вывод результатов тестирования команды test-app:

source: Testing Features
ru_ru: Особенности Тестирования

source: The ORM DSL allows mapping unidirectional relationships using a foreign key association instead
ru_ru: Вместо этого, ORM DSL позволяет сохранять однонаправленные отношения, используя ассоциативный внешний ключ.

source: The bootstrap script for example lets you bootstrap a Spring ApplicationContext instance to get access to the data source and so on (the integration tests use this):
ru_ru: Например скрипт bootstrap позволяет вам загружать экземпляр Spring ApplicationContext чтобы получить доступ к исходным данным и т.д. (это используют интеграционные тесты):

source: The documentation on testing has also been re-written around this new framework.
ru_ru: Документация по тестированию также была переписана в соответствие с этим новым каркасом.

source: The save method will persist your class to the database using the underlying Hibernate ORM layer.
ru_ru: Метод save сохранит ваш класс в базе данных при помощи лежащего в основе Hibernate ORM.

source: The PageRenderer service also allows you to pre-process GSPs into HTML templates:
ru_ru: Также служба PageRenderer позволяет подготавливать GSP к преобразованию в шаблоны HTML:

source: The PageRenderer class features a very similar API to the render method found within controllers:
ru_ru: Класс PageRenderer обладает API, очень похожим на метод контроллеров render:

source: The Basics
ru_ru: Основы

source: The GORM API
ru_ru: API GORM

source: The GORM API has been formalized into a set of classes (GormStaticApi, GormInstanceApi and GormValidationApi) that get statically wired into every domain class at the byte code level.
ru_ru: API GORM был формализован в ряд классов ( GormStaticApi , GormInstanceApi и GormValidationApi ), которые статически связаны с каждым доменным классом на уровне байт-кода.

source: The Grails Framework - Reference Documentation
ru_ru: Каркас Grails - Справочная документация

source: The Grails command will use any JVM options provided in the general JAVA_OPTS environment variable, but you can also specify a Grails-specific environment variable too:
ru_ru: Команда Grails будут использовать любые опции JVM, в основном обеспеченные переменной JAVA_OPTS среды выполнения, но вы можете также определить переменную среды выполнения, специфическую для Grails:

source: The Java Set type doesn't allow duplicates.
ru_ru: Java тип Set не позволяет дубликаты.

source: The SQL types are auto-detected from the Java types, but can be customized with Constraints or the ORM DSL.
ru_ru: SQL типы автоматически определяются из Java типов, но могут настраиваться Constraints (ограничениями) или ORM DSL.

source: The are several standard logging levels, which are listed here in order of descending priority:
ru_ru: Вот несколько стандартных уровней регистраторов, которые показаны здесь в порядке убывания приоритета:

source: The books property that GORM injects is a java.util.Set.
ru_ru: То "books" это свойство типа java.util.Set которое внедряется GORM.

source: The default URL Mapping mechanism supports camel case names in the URLs.
ru_ru: По умолчанию механизм связывания URL поддерживает верблюжий стиль имен URL.

source: The default URL for accessing an action named addNumbers in a controller named MathHelperController would be something like /mathHelper/addNumbers.
ru_ru: Обычно URL для доступа к акции addNumbers контроллера MathHelperController был что-то типа /mathHelper/addNumbers.

source: The default cascading behaviour is to cascade saves and updates, but not deletes unless a belongsTo is also specified:
ru_ru: Каскадное поведение по умолчанию применяется к сохранению и обновлению, но не к удалению, если не определено свойство belongsTo:

source: The default fetch strategy used by Grails is "lazy", which means that the collection will be lazily initialized on first access.
ru_ru: По умолчанию Grails использует "ленивую" стратегию выборки, это означает, что коллекция будет инициализирована только при первом обращении.

source: The default target
ru_ru: Цель по умолчанию

source: The example above will map to a table that looks like the following:
ru_ru: Пример выше будет отображать таблицу, которая будет выглядеть так:

source: The example above will save both face and nose.
ru_ru: Пример выше будет созранять как Face так и Nose.

source: The jQuery plugin is now the default JavaScript library installed into a Grails application.
ru_ru: jQuery плагин - теперь библиотека JavaScript по умолчанию, установленная в приложение Grails.

source: The keys for the map must be strings.
ru_ru: Ключ карты должен быть типа string.

source: The logging system uses that message level combined with the configuration for the logger (see next section) to determine whether the message gets written out.
ru_ru: Система протоколирования использует этот уровень сообщения в сочетании с конфигурацией регистратора (см. следующий раздел), чтобы определить, выводить ли сообщение.

source: The logical names appear in the URLs, so as long as you don't change those, your URLs will always remain the same no matter how much restructuring or changing of titles you do.
ru_ru: Логические имена появляются в URL-адресах, поэтому, пока вы не измените их, ваши URL-адреса всегда останутся неизменным независимо от того, сколько раз вы делаете реорганизацию или изменение названий.

source: The mechanism for doing this is the includeTargets property.
ru_ru: Механизм осуществления этого - свойство includeTargets.

source: The most common is from the GrailsApplication object, which is available as a variable in controllers and tag libraries:
ru_ru: Наиболее распространен объект GrailsApplication, который доступен как переменная в контроллерах и библиотеках тегов:

source: The next few sections show how to model the domain in GORM.
ru_ru: В следующих нескольких разделах показано, как моделировать домены в GORM.

source: The old documentation engine relied on you putting section numbers into the gdoc filenames.
ru_ru: Старый движок документации полагался на вас вводя номера разделов в файлы gdoc.

source: The only change required for this is to define the collection type as a Collection:
ru_ru: Единственое изменение, необходимое для этого - это определить тип коллекции как Collection:

source: The other way involves getting a reference to the ConfigurationHolder class that holds a reference to the configuration object:
ru_ru: Другой метод заключается в получении ссылки на класс ConfigurationHolder, который содержит ссылку на объект конфигурации:

source: The owning side of the relationship, in this case Author, takes responsibility for persisting the relationship and is the only side that can cascade saves across.
ru_ru: Принадлежащая сторона отношения, в данном случае Author, берет на себя ответственность за сохранение отношений и является единственной стороной, которая может каскадно сохранять.

source: The result is better code completion for IDEs, better integration with Java and the potential for more GORM implementations for other types of data stores.
ru_ru: Результат - лучшее завершение кода для IDE, лучшая интеграция с Java и потенциал для большего количества реализаций GORM для других типов хранилищ данных.

source: The result of the above class is that the Book instances in the books collection of the Author class will be ordered by their release date.
ru_ru: В результате выполнения кода выше, экземпляры Book коллекции books класса Author будут упорядочены по их дате выпуска.

source: The result of this is that we can create a Face, attach a Nose instance to it and when we save or delete the Face instance, GORM will save or delete the Nose.
ru_ru: В результате, при создании экземпляра Face, добавив к нему Nose, и если мы будем сохранять или удалять экземпляр Face, GORM будет сохранять или удалять Nose.

source: The result will be a class at grails-app/domain/org/bookstore/Book.groovy:
ru_ru: В результате будет создан класс grails-app/domain/org/bookstore/Book.groovy:

source: The resulting mapping would looking like this:
ru_ru: В результате отображение будет выглядеть следующим образом:

source: The same behavior is required for List types, since Hibernate needs to load the entire association to maintain order.
ru_ru: То же самое поведение необходимо для типа List, так как Hibernate необходимо загрузить все ассоциации для поддержания упорядочивания.

source: The static hasMany property defines the type of the elements within the Map.
ru_ru: Статическое свойство hasMany определяет тип элементов внутри карты.

source: The upshot of inheritance is that you get the ability to polymorphically query.
ru_ru: В результате наследования у вас появляется возможность создавать полиморфные запросы.

source: The way this works at the database level is Hibernate creates a books_idx column where it saves the index of the elements in the collection to retain this order at the database level.
ru_ru: На уровне базы данных это работает так: Hibernate создает колонку books_idx где хранит индексы элементов в коллекции.

source: Then later in your application you can access these settings in one of two ways.
ru_ru: Затем позже в ссвоем приложении вы можете получить доступ к этим настройкам одним из двух способов.

source: There are new templates for displaying test results that are clearer and more user friendly than the previous reports:
ru_ru: Появились новые шаблоны для отображения результатов тестов, которые стали более четким и удобным, чем в предыдущих отчетах:

source: There are numerous improvements to dependency resolution handling via Ivy including:
ru_ru: Появились многочисленные улучшения в решении зависимостей, управляемом при помощи Ivy, включая:

source: There are two main ways to get hold of a logger:
ru_ru: Есть два основных способа получить регистратор:

source: There is a new HTML5-based scaffolding UI:
ru_ru: Появился новый скаффолдинг UI, основанный на HTML5:

source: There is a new unit testing API based on mixins that supports JUnit 3, 4 and Spock style tests (with Spock 0.6 and above).
ru_ru: Появились новые API unit тестирования, основанные на смеси, поддерживающей тесты в стиле JUnit 3, 4 и Spock (от Spock 0.6 и выше).

source: Therefore it is recommended that if you anticipate a large numbers of records in the association that you make the association bidirectional so that the link can be created on the inverse side.
ru_ru: Поэтому, если вы ожидаете большое количество записей в ассоциации, рекомендуется создавать ассоциации двунаправленными, так чтобы ссылки могли быть созданы на другой стороне.

source: These are modeled in GORM as Groovy classes, so a Book class may have a title, a release date, an ISBN number and so on.
ru_ru: Они моделируются в GORM как классы Groovy, так у класса Book может быть название, дата выпуска, номер ISBN и что-нибудь еще.

source: These are special in that they can only be used in the configuration; you can't log messages at these levels.
ru_ru: Их особенность в том, что они могут быть использованы только в конфигурации; вы не можете регистрировать сообщеия этих уровней.

source: These loggers are cached and uniquely identified by name, so if two separate classes use loggers with the same name, those loggers are actually the same instance.
ru_ru: Эти регистраторы кэшируются и однозначно идентифицируется по имени, так что если два отдельных класса используют регистраторы с одним и тем же именем, то эти регистраторы на самом деле один и тот же экземпляр.

source: They are linked together through relationships; one-to-one, one-to-many, or many-to-many.
ru_ru: Они связаны взаимо отношениями: один-к-одному, один-ко-многим, или многие-ко-многим.

source: They hold state about business processes and hopefully also implement behavior.
ru_ru: Они хранят состояние бизнесс-процессов, и, мы надеемся, также реализуют поведение.

source: This behaviour is customizable through the ORM Domain Specific Language
ru_ru: Это поведение настраивается при помощи ORM Domain Specific Language

source: This can be a significant performance boost for applications that do a lot of database writes.
ru_ru: Это может дать значительный прирост производительности для приложений, которые делают много записей в базы данных.

source: This can be used to iterate over the collection:
ru_ru: Это может быть полезно при обходе коллекции:

source: This can lead to the n+1 problem if you are not careful.
ru_ru: Это может привести к проблемме n+1 если вы не будете осторожны.

source: This class will map automatically to a table in the database called book (the same name as the class).
ru_ru: Этот класс будет автоматически отображен в базе данный в таблице book (с тем же самым именем, как и у класса).

source: This documentation will take you through getting started with Grails and building web applications with the Grails framework.
ru_ru: Этот документ проведет вас к началу работы с Grails и созданию приложений при помощи каркаса Grails

source: This even works for GSP and static resources (with resources plugin 1.0.1).
ru_ru: Это работает даже для GSP и статических ресурсов (совместно с resources plugin 1.0.1).

source: This example configures loggers with names starting with 'org.codehaus.groovy.grails.web.servlet' to ignore any messages sent to them at a level of 'warn' or lower.
ru_ru: Этот пример конфигурирует регистратор с именем. начинающимся с 'org.codehaus.groovy.grails.web.servlet' игнорировать любые переданные ему сообщения уровня 'warn' или ниже.

source: This file uses Groovy's ConfigSlurper which is very similar to Java properties files except it is pure Groovy hence you can reuse variables and use proper Java types!
ru_ru: Этот файл используется Groovy's ConfigSlurper который очень похож на файл свойств Java, за исключением того, что это настоящий Groovy, следовательно, вы можете использовать переменные и надлежащие типы Java!

source: This incurs no database access until a method other than getId() is called.
ru_ru: Доступа к базе данных не будет, пока не будет вызван метод, отличный от getId().

source: This is also true if you have multiple collections that map to different properties on the many side:
ru_ru: Это также действительно, если у вас есть несколко коллекций, которые относятся к различным свойствам на стороне "многим":

source: This is one way of defining the default target for a script.
ru_ru: Это один из методов определения цели по умолчанию в скрипте.

source: This is the expected behaviour as, just like Hibernate, only one side of a many-to-many can take responsibility for managing the relationship.
ru_ru: Это ожидаемое поведение, какраз в стиле Hibernate, только одна сторона отношения "многие-ко-многим" может взять на себя ответственность за управление отношениями.

source: This is typically done for you automatically by Grails, which manages your Hibernate session.
ru_ru: Обычно это выполняется для вас автоматически Grails, который управляет сессией Hibernate.

source: This lets you call the default target directly from other scripts if you wish.
ru_ru: Это позволит вам вызывать цель по умолчанию напрямую из других скриптов, если вы захотите.

source: This lets you use the save and delete methods as well as other GORM methods transparently.
ru_ru: Это позволяет вам прозрачно использовать методы save и delete, а также другие методы GORM.

source: This loads an interactive GUI where you can run Groovy commands with access to the Spring ApplicationContext, GORM, etc.
ru_ru: Эта команда загрузит интерактивный GUI где вы можете запустить команды Groovy, получить доступ к Spring ApplicationContext, GORM, и т.д.

source: This means that while in previous versions of Grails the war command produced many lines of output, in Grails 2.0 only 1 line of output is produced:
ru_ru: Это означает, что в то время как в предыдущих версиях Grails команда war выводила много строк, в Grails 2.0 выводится только 1 строка:

source: This results in greatly improved reliability when reloading changes and also ensures that the class files stored in disk remain consistent with the class files loaded in memory, which reduces the need to run the clean command.
ru_ru: В результате значительно улучшилась надежность при перегрузке изменений, а также гарантирует, что файлы классов, хранящиеся на диске остаются в соответствии с файлами классов, загруженными в память, что снижает необходимость запускать команду clean.

source: This says that for loggers whose name starts with 'org.codehaus.groovy.grails.web.servlet' or 'org.codehaus.groovy.grails.web.pages', only messages logged at 'error' level and above will be shown.
ru_ru: Здесь сказано, что для регистраторов, чьи имена начинаются с 'org.codehaus.groovy.grails.web.servlet' или 'org.codehaus.groovy.grails.web.pages', будут показываться сообщения только уровня 'error'или выше.

source: This section covers the new features that are present in 2.0 and is broken down into sections covering the build system, core APIs, the web tier, persistence enhancements and improvements in testing.
ru_ru: Этот раздел охватывает новые особенности, представленные в 2.0 и разбит на разделы, посвященные системе сборки, основным интерфейсам, веб-уровню, улучшению персистентности и усовершенствованию тестирования.

source: This uses the get method that expects a database identifier to read the Person object back from the database.
ru_ru: Здесь используется метод get который исследует идентификаторы базы данных, считывает объект Person и возвращает его из базы.

source: This will create a class at the location grails-app/domain/helloworld/Person.groovy such as the one below:
ru_ru: Ниже показанно, как будет создан класс, расположенный grails-app/domain/helloworld/Person.groovy:

source: This will create a logger with the name 'org.other.MyClass' - note the lack of a 'grails.app.' prefix since the class isn't an artifact.
ru_ru: Это создаст регистратор с именем 'org.other.MyClass' - заметьте отсутствие префикса 'grails.app.', так как класс не является артефактом.

source: This will help drive the roadmap and increase support of key plugins while reducing the need to support older or less popular plugins thus helping plugin development teams focus their efforts.
ru_ru: Это поможет продвигать план развития и усилить поддержку основных плагинов с одновременным снижением необходимости поддержки устаревших и менее используемых плагинов, тем самым помогая команде разработчиков плагинов фокусировать свои усилия.

source: To activate interactive mode type 'grails' at the command line and then use TAB completion to get a list of commands:
ru_ru: Для активации интерактивного режима введите в командной строке 'grails' и используйте TAB завершение чтобы получить список команд:

source: To be honest, you can use whichever you prefer - there don't seem to be any major advantages in either case.
ru_ru: Честно говоря, вы можете использовать что вам будет угодно - там, кажется, в любом случае не будет каких-либо серьезных преимуществ.

source: To create a domain class use Map constructor to set its properties and call save:
ru_ru: При создании доменного класса, используйте Map конструктор чтобы установиь его свойства и вызовите метод - save:

source: To create a domain class you run the create-domain-class command as follows:
ru_ru: Для создания доменного класса выполните команду create-domain-class как показано ниже:

source: To delete an instance use the delete method:
ru_ru: Для удаления экземпляра используйте метод delete:

source: To enable hyphenated URLs assign a value of "hyphenated" to the grails.web.url.converter property in grails-app/conf/Config.groovy.
ru_ru: Для разрешения написанных через дефис URL назначте свойству grails.web.url.converter значение "hyphenated" в файле grails-app/conf/Config.groovy.

source: To enhance community awareness of the most popular plugins an opt-in plugin usage tracking system has been included where users can participate in providing feedback to the plugin community on which plugins are most popular.
ru_ru: Для повышения осведомленности сообщества о наиболее популярных плагинах, включена система отслеживания используемых плагинов, чтобы пользователи могли принять участие в обратной связи с сообществом.

source: To ensure uniqueness when adding an entry to a Set association Hibernate has to load the entire associations from the database.
ru_ru: Когда добавляется запись к ассоциации типа Set, для обеспечения уникальности Hibernate должен загрузить все ассоциации из базы данных.

source: To get a list of all commands and some help about the available commands type:
ru_ru: Чтобы получить список всех команд и соответствующую справку о доступных командах введите команду:

source: To have custom ordering you configure the Set as a SortedSet:
ru_ru: Чтобы воспользоваться упорядочиванием, определите набор как SortedSet:

source: To keep objects in the order which they were added and to be able to reference them by index like an array you can define your collection type as a List:
ru_ru: Для содержания объектов в порядке, в котором они были добавлены, и чтобы иметь возможность ссылаться на них по индексу как в массиве, вы должны определить тип вашей коллекции как List:

source: To make the relationship a true one-to-one, use the hasOne property on the owning side, e.g. Face:
ru_ru: Чтобы сделать отношения действительно один-к-одному, используйте свойство hasOne на стороне владельца, т.е. Face:

source: To make this relationship bidirectional define the other side as follows:
ru_ru: Чтобы сделать эти отношения двунаправленными, определите так с другой стороны:

source: To reduce risk of XSS attacks, set this to 'html'.
ru_ru: Для уменьшения риска XSS атак установите его в 'html'.

source: To support the addition of DetachedCriteria queries and encourage their use a new where method and DSL has been introduced to greatly reduce the complexity of criteria queries:
ru_ru: Для поддержки добавления запросов DetachedCriteria и поощрения использования ими нового метода where был введен новый DSL со значительно сниженной сложностью запроса критериев:
